{"class_name": "Model", "config": {"name": "model_1199", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_799"}, "name": "input_799", "inbound_nodes": []}, {"class_name": "Model", "config": {"name": "model_1197", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_799"}, "name": "input_799", "inbound_nodes": []}, {"class_name": "TCN", "config": {"name": "tcn_1168", "trainable": true, "dtype": "float32", "nb_filters": 16, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_1168", "inbound_nodes": [[["input_799", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1168", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1168", "inbound_nodes": [[["tcn_1168", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_584", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_584", "inbound_nodes": [[["batch_normalization_1168", 0, 0, {}]]]}, {"class_name": "TCN", "config": {"name": "tcn_1169", "trainable": true, "dtype": "float32", "nb_filters": 16, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_1169", "inbound_nodes": [[["max_pooling1d_584", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1169", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1169", "inbound_nodes": [[["tcn_1169", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_585", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_585", "inbound_nodes": [[["batch_normalization_1169", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_399", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_399", "inbound_nodes": [[["max_pooling1d_585", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1197", "trainable": true, "dtype": "float32", "units": 21, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1197", "inbound_nodes": [[["flatten_399", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1198", "trainable": true, "dtype": "float32", "units": 21, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1198", "inbound_nodes": [[["flatten_399", 0, 0, {}]]]}, {"class_name": "Sampling", "config": {"name": "sampling_399", "trainable": true, "dtype": "float32"}, "name": "sampling_399", "inbound_nodes": [[["dense_1197", 0, 0, {}], ["dense_1198", 0, 0, {}]]]}], "input_layers": [["input_799", 0, 0]], "output_layers": [["dense_1197", 0, 0], ["dense_1198", 0, 0], ["sampling_399", 0, 0]]}, "name": "model_1197", "inbound_nodes": [[["input_799", 0, 0, {}]]]}, {"class_name": "Model", "config": {"name": "model_1198", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_800"}, "name": "input_800", "inbound_nodes": []}, {"class_name": "Dense", "config": {"name": "dense_1199", "trainable": true, "dtype": "float32", "units": 256, "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1199", "inbound_nodes": [[["input_800", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_399", "trainable": true, "dtype": "float32", "target_shape": [16, 16]}, "name": "reshape_399", "inbound_nodes": [[["dense_1199", 0, 0, {}]]]}, {"class_name": "UpSampling1D", "config": {"name": "up_sampling1d_584", "trainable": true, "dtype": "float32", "size": 2}, "name": "up_sampling1d_584", "inbound_nodes": [[["reshape_399", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1170", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1170", "inbound_nodes": [[["up_sampling1d_584", 0, 0, {}]]]}, {"class_name": "TCN", "config": {"name": "tcn_1170", "trainable": true, "dtype": "float32", "nb_filters": 16, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_1170", "inbound_nodes": [[["batch_normalization_1170", 0, 0, {}]]]}, {"class_name": "UpSampling1D", "config": {"name": "up_sampling1d_585", "trainable": true, "dtype": "float32", "size": 2}, "name": "up_sampling1d_585", "inbound_nodes": [[["tcn_1170", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1171", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1171", "inbound_nodes": [[["up_sampling1d_585", 0, 0, {}]]]}, {"class_name": "TCN", "config": {"name": "tcn_1171", "trainable": true, "dtype": "float32", "nb_filters": 16, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_1171", "inbound_nodes": [[["batch_normalization_1171", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d_399", "trainable": true, "dtype": "float32", "filters": 6, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "selu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d_399", "inbound_nodes": [[["tcn_1171", 0, 0, {}]]]}], "input_layers": [["input_800", 0, 0]], "output_layers": [["conv1d_399", 0, 0]]}, "name": "model_1198", "inbound_nodes": [[["model_1197", 1, 2, {}]]]}, {"class_name": "TCN", "config": {"name": "tcn_1168", "trainable": true, "dtype": "float32", "nb_filters": 16, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_1168", "inbound_nodes": [[["input_799", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1168", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1168", "inbound_nodes": [[["tcn_1168", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_584", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_584", "inbound_nodes": [[["batch_normalization_1168", 0, 0, {}]]]}, {"class_name": "TCN", "config": {"name": "tcn_1169", "trainable": true, "dtype": "float32", "nb_filters": 16, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_1169", "inbound_nodes": [[["max_pooling1d_584", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1169", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1169", "inbound_nodes": [[["tcn_1169", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_585", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_585", "inbound_nodes": [[["batch_normalization_1169", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_399", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_399", "inbound_nodes": [[["max_pooling1d_585", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1198", "trainable": true, "dtype": "float32", "units": 21, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1198", "inbound_nodes": [[["flatten_399", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_399", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_399", "op": "AddV2", "input": ["AddV2_399/x", "dense_1198/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 1.0}}, "name": "tf_op_layer_AddV2_399", "inbound_nodes": [[["dense_1198", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Exp_399", "trainable": true, "dtype": "float32", "node_def": {"name": "Exp_399", "op": "Exp", "input": ["dense_1198/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Exp_399", "inbound_nodes": [[["dense_1198", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1197", "trainable": true, "dtype": "float32", "units": 21, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1197", "inbound_nodes": [[["flatten_399", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_798", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub_798", "op": "Sub", "input": ["AddV2_399", "Exp_399"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sub_798", "inbound_nodes": [[["tf_op_layer_AddV2_399", 0, 0, {}], ["tf_op_layer_Exp_399", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Square_399", "trainable": true, "dtype": "float32", "node_def": {"name": "Square_399", "op": "Square", "input": ["dense_1197/Identity"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Square_399", "inbound_nodes": [[["dense_1197", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_799", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub_799", "op": "Sub", "input": ["Sub_798", "Square_399"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sub_799", "inbound_nodes": [[["tf_op_layer_Sub_798", 0, 0, {}], ["tf_op_layer_Square_399", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sum_399", "trainable": true, "dtype": "float32", "node_def": {"name": "Sum_399", "op": "Sum", "input": ["Sub_799", "Sum_399/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": -1}}, "name": "tf_op_layer_Sum_399", "inbound_nodes": [[["tf_op_layer_Sub_799", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_399", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_399", "op": "Mul", "input": ["Mul_399/x", "Sum_399"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": -1.9611438512802124}}, "name": "tf_op_layer_Mul_399", "inbound_nodes": [[["tf_op_layer_Sum_399", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mean_399", "trainable": true, "dtype": "float32", "node_def": {"name": "Mean_399", "op": "Mean", "input": ["Mul_399", "Mean_399/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, "constants": {"1": [0]}}, "name": "tf_op_layer_Mean_399", "inbound_nodes": [[["tf_op_layer_Mul_399", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "RealDiv_399", "trainable": true, "dtype": "float32", "node_def": {"name": "RealDiv_399", "op": "RealDiv", "input": ["Mean_399", "RealDiv_399/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 384.0}}, "name": "tf_op_layer_RealDiv_399", "inbound_nodes": [[["tf_op_layer_Mean_399", 0, 0, {}]]]}, {"class_name": "AddLoss", "config": {"name": "add_loss_399", "trainable": true, "dtype": "float32", "unconditional": false}, "name": "add_loss_399", "inbound_nodes": [[["tf_op_layer_RealDiv_399", 0, 0, {}]]]}], "input_layers": [["input_799", 0, 0]], "output_layers": [["model_1198", 1, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}