{"class_name": "Model", "config": {"name": "model_1197", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 6], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_799"}, "name": "input_799", "inbound_nodes": []}, {"class_name": "TCN", "config": {"name": "tcn_1168", "trainable": true, "dtype": "float32", "nb_filters": 16, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_1168", "inbound_nodes": [[["input_799", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1168", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1168", "inbound_nodes": [[["tcn_1168", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_584", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_584", "inbound_nodes": [[["batch_normalization_1168", 0, 0, {}]]]}, {"class_name": "TCN", "config": {"name": "tcn_1169", "trainable": true, "dtype": "float32", "nb_filters": 16, "kernel_size": 3, "nb_stacks": 1, "dilations": [1, 2, 4, 8], "padding": "causal", "use_skip_connections": true, "dropout_rate": 0.0, "return_sequences": true, "activation": "selu", "use_batch_norm": false, "use_layer_norm": false, "kernel_initializer": "he_normal"}, "name": "tcn_1169", "inbound_nodes": [[["max_pooling1d_584", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1169", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1169", "inbound_nodes": [[["tcn_1169", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_585", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d_585", "inbound_nodes": [[["batch_normalization_1169", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_399", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_399", "inbound_nodes": [[["max_pooling1d_585", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1197", "trainable": true, "dtype": "float32", "units": 21, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1197", "inbound_nodes": [[["flatten_399", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1198", "trainable": true, "dtype": "float32", "units": 21, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1198", "inbound_nodes": [[["flatten_399", 0, 0, {}]]]}, {"class_name": "Sampling", "config": {"name": "sampling_399", "trainable": true, "dtype": "float32"}, "name": "sampling_399", "inbound_nodes": [[["dense_1197", 0, 0, {}], ["dense_1198", 0, 0, {}]]]}], "input_layers": [["input_799", 0, 0]], "output_layers": [["dense_1197", 0, 0], ["dense_1198", 0, 0], ["sampling_399", 0, 0]]}, "keras_version": "2.3.0-tf", "backend": "tensorflow"}